export default {
    returnCode: 1000,
    datainfo: [
        {title: "测试第0条新闻", time: "2018-11-01 11:40:15"},
        {title: "测试第1条新闻", time: "2018-11-02 11:40:15"},
        {title: "测试第2条新闻", time: "2018-11-03 11:40:15"},
        {title: "测试第3条新闻", time: "2018-11-04 11:40:15"},
        {title: "测试第4条新闻", time: "2018-11-05 11:40:15"},
        {title: "测试第5条新闻", time: "2018-11-06 11:40:15"},
        {title: "测试第6条新闻", time: "2018-11-07 11:40:15"},
        {title: "测试第7条新闻", time: "2018-11-08 11:40:15"},
        {title: "测试第8条新闻", time: "2018-11-09 11:40:15"},
        {title: "测试第9条新闻", time: "2018-11-10 11:40:15"},
        {title: "测试第10条新闻", time: "2018-11-11 11:40:15"},
        {title: "测试第11条新闻", time: "2018-11-12 11:40:15"},
        {title: "测试第12条新闻", time: "2018-11-13 11:40:15"},
        {title: "测试第13条新闻", time: "2018-11-14 11:40:15"},
        {title: "测试第14条新闻", time: "2018-11-15 11:40:15"},
        {title: "测试第15条新闻", time: "2018-11-16 11:40:15"},
        {title: "测试第16条新闻", time: "2018-11-17 11:40:15"},
        {title: "测试第17条新闻", time: "2018-11-18 11:40:15"},
        {title: "测试第19条新闻", time: "2018-11-19 11:40:15"},
        {title: "测试第20条新闻", time: "2018-11-20 11:40:15"},
        {title: "测试第21条新闻", time: "2018-11-21 11:40:15"},
        {title: "测试第22条新闻", time: "2018-11-22 11:40:15"}
    ]
}