<template>
  <!-- 用户协议弹窗 -->
  <common-alert :content="{title: '服务协议提示'}" :custom="true" custom-confirm-text="已阅读" @close="handlePopupConfirm" :show="isHandleAlert">

    <ul class="custom_alert">
      <li class="title">
        社会合伙人业务代办协议
      </li>
      <li class="item">
        为促进移动通信市场持续、健康发展，经甲乙双方友好协商，本着互惠互利、共同发展的原则，双方签署有关代办员业务代办协议，并恪守各自的责任与义务。
      </li>
      <li class="item">
        一、合作方式
      </li>
      <li class="item">
        （一）乙方通过网络（链接或二维码）页面签约本协议，姓名             身份证号码：                    作为代办员移动社会合伙人来代理甲方业务。（附件1：乙方身份证复印件上传）
        <br>
        （二）甲方授权乙方代理的业务范围（在授权业务种类□内划√，在非授权业务种类内□划×）：SIM卡销售，办理入网业务、TDS/TDL终端销售、存量业务发展、流量业务发展、宽带业务发展；
      </li>
      <li class="item">
        二、乙方资质
      </li>
      <li class="item">
        （一）熟悉移动通信的基本业务知识，经过正规培训，并能通过甲方培训考试通过，能为客户提供良好服务；<br>
        （二）具有较好的经营素质；<br>
        （三）能维护中国移动的品牌形象与信誉；<br>
      </li>
      <li class="item">
        三、业务办理奖励支付标准及结算方式
      </li>
      <li class="item">
        甲方根据乙方实际销售情况支付业务办理奖励。奖励标准由甲方根据市场发展需求或上级主管部门规定制定和变更，如遇奖励标准调整，由甲方负责通知乙方。
      </li>
      <li class="item">
        四、甲方的权利义务
      </li>
      <li class="item">
        （一）甲方根据乙方的销售业务量、服务质量和实际需要，可提供业务宣传手册等方面的支持。
        <br> （二）甲方不定期对乙方服务质量、业务能力、经营情况等内容进行监督检查和业务指导。
        <br> （三）甲方有权根据乙方的考核成绩、服务情况或乙方造成甲方的财产、声誉损失程度，向乙方追究经济补偿，或解除本协议。
        <br> （四）甲方按时向乙方支付业务办理奖励。
      </li>
      <li class="item">
        五、乙方的权利与义务
      </li>
      <li class="item">
        （一）乙方遵守甲方业务规范和指导，严格执行甲方有关业务规定和资费政策。
        <br> （二）乙方在业务推广或广告宣传时，未经甲方授权，不得使用甲方VI标识或品牌形象；如使用应提前两天通知甲方，并将内容及样本提交甲方进行审核，甲方同意后方可实施。
        <br> （三）乙方应严格遵守甲方有关移动通信业务的规程制度，认真核查客户身份证件原件，严密保管客户原始档案，并于2日内将新发展的客户资料送至甲方。乙方发展的客户由于证件不全、不真造成的一切后果均由乙方负责。
        <br> （四）乙方发展销售甲方业务（包括卡号销售、终端销售等），应销售给真实客户。禁止乙方在没有销售给客户的情况下采用激活卡号、激活手机IMEI等方式以套取业务办理奖励或谋取其他利益，禁止乙方囤卡、养卡、批开或与SP合作套取结算利益等行为。
        <br> （五）禁止乙方向客户推荐业务时采用虚假承诺或宣传，出现误导客户购买的情形，或者向客户推荐业务中出现强买强卖行为；禁止乙方未经客户确认私自代客户开通业务；禁止乙方未经甲方同意擅自向客户收取手续费及其它杂费。
        <br> （六）乙方在经营活动中应恪守信誉，讲究职业道德，树立良好形象。如因乙方经营管理不善引起各种纠纷，致使甲方经济利益或社会形象受到影响，一切后果由乙方承担。
        <br> （七）乙方坚持诚信经营，承诺销售任何通信终端产品严格遵守国家的法规要求，不经营假冒伪劣产品；由于通信终端产品质量与售后服务造成的任何后果，均由乙方独自承担。如甲方发现乙方违反诚信原则时，甲方有权解除本协议。
        <br> （八）乙方在受理甲方授权的移动电话入网等业务时，要遵守国家相关法律法规规定的电话用户真实身份信息登记规定，具体如下：
        <br> 1、乙方在受理个人办理电话用户真实身份信息登记的。
        <br> 2、乙方在受理入网等业务时，应当对客户出示的证件原件进行查验。
        <br> （九）乙方需严格遵守甲方“五条禁令”规定，严禁泄露或交易客户信息；严禁发送违法信息，或未经客户同意发送商业广告信息；严禁未经客户确认擅自为客户开通或变更业务；严禁串通、包庇、纵容增值服务提供商泄漏客户信息、擅自为客户开通数据及信息化业务或实施其它侵害客户权益的行为；
        严禁串通、包庇、纵容渠道或系统合作商泄漏客户信息、侵吞客户话费、擅自过户或销号、倒卖卡号资源或实施其它侵害客户权益的行为。
      </li>
      <li class="item">
        六、保密条款
      </li>
      <li class="item">
        （一）乙方严格保守国家通信秘密，遵守有关的法律、法规。
        <br> （二）乙方承诺严格保守甲方的商业秘密。商业秘密是指甲方生产经营的策略及规划、业务流程、客户资料、卡号资源情况、收入情况、人员状况，以及甲方指定的其他内容。
        <br> （三）乙方严格遵守甲方的业务流程，并保管好甲方提供的系统工号和密码，严禁提供给他人使用。
        <br> （四）如乙方违反保密条款的相关内容，甲方有权终止双方合作，扣除全额履约信用金，并追究乙方相关法律责任。
      </li>
      <li class="item">
        七、履约信用金及违约责任
      </li>
      <li class="item sign">
       （一）乙方及其法定代表人、负责人名下和其投资参与经营的所有店面直接或间接经营、销售、宣传其他通信运营商业务的，第一次发现，甲方有权收取2000元的违约金；第二次发现直接解除协议，并扣除全部履约信用金及全部未返业务办理奖励。
        <br> （二）乙方在受理甲方授权的移动电话入网等业务时，乙方不按照相关规定执行电话用户真实身份信息登记的，第一次发现，甲方有权收取2000元的违约金；第二次发现直接解除协议，并扣除全部履约信用金及全部未返业务办理奖励代办酬金，且永不合作。
        <br> （三）乙方出现以下违约行为之一的，甲方有权按照以下标准收取乙方违约金：
        <br> （1）乙方未按规定保管甲方分配的工号，甲方有权收取500元/次的违约金。
        <br> （2）乙方未经甲方同意，违反协议约定使用甲方VI标识和“中国移动通信”商标，甲方有权收取500元/次的违约金。
        <br> （3）乙方不遵守甲方业务管理与指导，不参加甲方统一要求参加的促销与宣传活动，甲方有权收取1000元/次的违约金。
        <br> （4） 乙方违反协议低价、高价销售SIM卡及其它有价卡、从其他途径领卡或转批已领取的SIM卡及其它有价卡，甲方有权收取1000元/次的违约金。
        <br> （5）乙方泄露甲方企业及客户资料，甲方有权收取5000元/次的违约金，直接终止协议并追究其法律责任。
        <br> （6）乙方因虚假经营，恶意套取甲方酬金和营销资源而出现养卡行为的，养卡数量超过10户且占放号比例超过10%的，在追回已发酬金的基础上按照100元/户的标准收取违约金。
        <br> （7）违反协议约定虚假经营，恶意套取酬金和营销资源而进行养机行为的，养机数量超过5部且占销售终端比例10%的，在追回已发酬金基础上，按照所发业务办理奖励的2倍进行扣罚违约金。
        <br> （8）乙方发展的客户出现SP套取结算利益、产生垃圾短信的行为，甲方有权收取100元/号的违约金。
        <br> （9）乙方违反协议出现虚假承诺或宣传、出现误导客户购买、向客户推荐业务中出现强买强卖行为、擅自向客户收取手续费或其他杂费的行为，甲方有权收取500元/次的违约金。
        <br> （10）乙方违反协议私自转让代理权和转授权，甲方有权收取1000元/次的违约金。
        <br> （11）乙方对吉祥号码、优质号码在其原有话费面值基础上进行加价销售，以“选号费”、“卡费”等名义赚取不当得利的，甲方有权收取2000元/号的违约金。
        <br> （12）违反协议约定恶意套取社会渠道费用或营销活动资源达到一定数量、金额或标准的以及勾结公司内部人员等合谋套利的，一经公司监控发现，立即解除合作，并按照不少于5倍于恶意套取社会渠道费用及活动资源进行扣罚。
        <br> （四）乙方出现如下违约行为之一的，甲方除扣罚乙方全部履约信用金和未发放的酬金作为违约金外，应与乙方立即解除本协议。
        <br> （1）若因乙方的行为造成黑卡出现的，除按以上办法处理外，将涉案的乙方从严处罚移交至公安机关。
        <br> “黑卡”定义：未进行实名登记而被不法分子利用进行传播淫秽色情信息、实施通讯信息诈骗、组织实施恐怖活动等违法犯罪活动的移动电话卡（含无线上网卡）。
        <br> （2）出现协议第六条第（十六）项列举的乙方违约行为的；
        <br> （3）出现协议第八条第（四）款第3项列举的乙方违约行为累计达到三次的；
        <br> （4）出现协议第八条第（四）款第9项列举的乙方违约行为累计达到三次的；
        <br> （3）乙方不遵守甲方业务管理与指导，不参加甲方统一要求参加的促销与宣传活动，甲方有权收取1000元/次的违约金。
        <br> （5）若乙方的违规行为导致客户越级投诉、被媒体曝光、法律诉讼或政府监管等事件。
        <br> （6）非实名制号卡，流入外省销售的。
        <br> （五）如乙方违反协议规定，乙方应及时向甲方缴纳违约金或由甲方采取扣减代办酬金的方式收取违约金，酬金不足部分，将从保证金中扣罚。
        <br> （六）乙方不得有偿或无偿的以任何形式将本协议项下的代理权转让给任何第三方或转授权给任何第三方，并不得与任何第三方共同行使本协议项下的代理权，不得发展任何形式的下级代理商。
        <br> （七）如因违法、侵权等经营移动业务以外的产品，给甲方造成损失的，乙方须全额赔偿，出现法律诉讼的，乙方须承担相应的法律规定的义务。对于给甲方造成名誉损失的，甲方有权收取3000元/次的违约金，情节严重的，停发所有业务办理奖励并解除合同。
      </li>
      <li class="item">
        九、附加条款
      </li>
      <li class="item">
        （一）本协议经网络签约日起，三年内有效。协议期满前一个月内，如双方继续合作，经双方确认无异议，可自动延期三年。
        <br> （二）如果任何争议或权利要求起因于本协议或与本协议有关或与本协议的解释、违约、终止或效力有关，都应由协议各方通过友好协商解决。
        <br> 如果在一方提出协商要求后的十（10）天内，协议各方通过协商不能解决争议，则各方同意按下列2种方式解决：
        <br> （1） 将该争议提交至当地仲裁委员会。该会依据其现行有效的仲裁规则在当地进行仲裁。
        <br> 本协议项下的任何仲裁裁决是终局的，并对协议各方具有约束力，并可在任何有管辖权的法院或其他有权机构强制执行。除非仲裁裁决有不同规定，败诉方应支付协议各方因仲裁所发生的一切法律费用，包括但不限于律师费。
        <br> 如果在一方提出协商要求后的十（10）天内，协议各方通过协商不能解决争议，则各方同意按下列2种方式解决：
        <br> （2） 向所在区县人民法院提起诉讼
        <br> （三）本协议签订前，如甲乙双方已签订其他业务代办协议，出现抵触条款均以本协议之规定为准。
      </li>
      <li class="item">
        甲方　　　(章)           乙方      (章)
        <br> 代表人:　　　　　　　　　　　代表人：
        <br> 年　　月　　日　　　　　       年　　月　　日
        <br>
      </li>
    </ul>
  </common-alert>
</template>
<script>
export default {
  name: 'clerkAlert',
  /* ********************** props ********************** */
  props: {
    isHandleAlert: {
      type: Boolean,
      default: false
    },
    type: {
      type: String,
      default: 'newForm'
    }
  },

  /* ********************** data ********************** */

  data() {
    return {
    }
  },

  /* ********************** computed ********************** */

  computed: {},

  /* ********************** methods ********************** */

  methods: {
    // 协议弹窗回调
    handlePopupConfirm(type) {
      this.$emit('confirm', type)
    }
  },

  /* ********************** created ********************** */

  created() {
  }
}
</script>

<style lang="less" scoped>
.custom_alert {
  height: 8rem;
  padding: 0.3rem;
  overflow: auto;
  line-height: 0.36rem;
  .item {
    font-size: 0.22rem;
    color: #6F6F6F;
  }
  .sign{
    color: red;
  }
  .title {
    font-size: 0.3rem;
    font-weight: 700;
    text-align: center;
  }
}
</style>
