<template>
  <!-- 用户协议弹窗 -->
  <common-alert :content="{title: '服务协议提示'}" :custom="true" custom-confirm-text="已阅读" @close="handlePopupConfirm" :show="isHandleAlert">
    <ul class="custom_alert" v-if=" type == 'magic'">
      <li class="item title">
        “魔百和” 业务服务协议
      </li>
      <li class="item">
        甲方：
      </li>
      <li class="item">
        乙方：中国移动通信集团山东有限公司××分公司
      </li>
      <li class="item">
        一、协议双方的权利与义务<br> 1、甲方接受中国移动通信集团山东有限公司（以下简称“乙方”）提供的“魔百和” 业务服务，需办理相关业务登记手续。甲方办理登记手续时，需向乙方提供真实有效的身份证件原件：甲方委托他人办理入网时需提供本人及代理人真实有效身份证件原件及委托书。经营性场所申请 “魔百和” 业务的，应出示真实有效的批准文件和《营业执照》原件。<br> 2、甲方保证登记资料真实、准确，并有义务配合乙方核实登记资料。如甲方登记资料发生变更，应及时通知乙方，并到乙方指定地点办理资料变更/完善手续。因甲方或其代理人提供的资料不详、不实或变更后未及时办理资料完善手续等原因所造成的后果由甲方自行承担。如乙方发现甲方登记资料不真实，且无法与甲方取得联系或甲方未及时配合更正，乙方有权暂停向甲方提供 “魔百和” 业务服务。<br> 3、 “魔百和” 业务是基于乙方宽带业务而提供的服务，甲方应注意避免手机或宽带业务到期或提前终止导致 “魔百和” 业务无法使用。宽带到期或者提前终止的，甲方仍应继续承担 “魔百和” 业务费用。<br> 4、乙方提前一个月在报纸公告，并向甲方发送通知短信后，可以提前终止 “魔百和” 业务，剩余部分费用（不计利息）予以退还。<br> 5、乙方有权根据甲方申请的 “魔百和” 业务种类及优惠内容向甲方收取相关费用，包括开户费、“魔百和” 业务使用费以及甲方申请的其他业务的费用（以下合称“魔百和” 费用）。 “魔百和” 业务各项业务资费标准和优惠内容详见乙方网站、营业厅业务说明或公告； “魔百和” 业务计费周期和业务种类如有变动，乙方将以报纸、电视、广播、网站、营业厅、短信或电话等形式之一告示甲方，变更后的情况以乙方公告或通知为准。请甲方对前述公告或通知保持必要的关注，以免造成误解和不利影响。<br> 6、甲方采用包月缴费方式的 “魔百和” 业务的，包月期到期前，甲方未办理变更或取消 “魔百和” 业务（以下称“销户”）手续的，甲方同意包月期自动顺延一个月，续延次数不限，资费按续延生效之日的包月资费计收。甲方账户余额如不足以支付包月费用，乙方有权暂停 “魔百和” 业务。<br> 7、甲方采用包年（包一年、包两年等）缴费方式的 “魔百和” 业务的，包年有效期内不受资费调整的影响。在包年有效期截止之前，甲方应及时办理续包业务，续包资费按办理续包时的资费标准计收。若甲方逾期未办理续包手续也未办理变更或销户手续的，按照 _____ 资费执行。<br> 8、包月/包年期内甲方销户的视为违约，甲方预缴包月/包年费用不再返还。
        <br> 9、甲方应妥善保管用户名及各类密码。凡使用甲方用户名、各类密码的行为均被视为甲方或甲方授权的行为，因自身原因使用不善或被他人使用所造成的损失，由甲方自己承担。
        <br> 10、“魔百和” 安装开通时乙方向甲方提供市场价值____元的机顶盒1台，且收取相应设备押金（保证金）_____元/购买款_________元；若为押金方式租赁机顶盒，甲方退网时需向乙方提供押金收据和完好可用的机顶盒设备，甲方如无法提供押金收据和完好可用的机顶盒设备，则需赔付乙方_____ 元设备费用，乙方为甲方退还保证金，并办理退网业务。若为购买方式购买机顶盒设备，乙方不退还甲方购买费用。<br> 11、甲方 “魔百和” 终端建议通过有线方式安装，甲方需自备有线接入终端，如需通过无线方式安装，甲方需自备无线接入终端，因甲方自备无线接入终端导致的用户体验不佳等问题，乙方不承担责任。无论何种方式，甲方均需确保具备满足 “魔百和” 业务正常开通和使用的网络条件。如果非因乙方原因无法接入的，乙方向甲方退还自无法接入日后的所有预收款项（不计息），乙方与甲方双方互不承担赔偿责任，同时本协议终止。<br> 12、乙方在甲方办理相关开户手续并缴清相关费用后按双方预约日期上门安装，因乙方原因未及时开通的，应免收甲方自申请之日至服务开通期间的 “魔百和” 业务费用。甲方需在安装前做好有线宽带、有线接入端口、无线接入设备（在有线无法安装的情况下）、电视机（至少具备一个HDMI接口或一个VGA接口，高清节目则需要HDMI支持）等有关准备工作，由于甲方自身原因无法及时安装的，乙方不承担责任。<br> 13、甲方在使用 “魔百和” 业务过程中，若出现网络故障问题不能使用，乙方负责免费上门服务。但如果是因为甲方终端设备本身软硬件问题或甲方室内线路问题等自身原因造成业务使用障碍的，由甲方自行解决。<br> 14、甲方在包月/包年期内非乙方过错引发的无法使用 “魔百和” 业务，包月/包年期的时间不予延长并且资费照常收取。<br> 15、甲方应按照与乙方约定的时间、方式、及时、足额地向乙方支付 “魔百和” 业务费用。除非双方另有约定，甲方应在包月/包年服务开始前缴清该段期限的 “魔百和” 业务费用。逾期未交的款项，自付费日期期满后次日起，甲方每日应按照未交款项3‰（千分之三）向乙方支付违约金。超过30日未支付的，乙方有权暂停服务，超过60日未支付的，乙方有权终止提供服务，对甲方 “魔百和” 做销户处理，并保留对甲方追缴欠费的权利。被暂停或被终止使用的业务在所有欠费未缴清、相关手续未办妥期间产生的费用仍由甲方支付。<br> 16、甲方同一名下使用乙方提供的多项业务时，若其中一项产生欠费，乙方有权在甲方同一名下其他任何业务或产品账户上扣取欠费。
        <br> 17、若甲方对乙方收取的 “魔百和” 业务费用存有疑义，应在“魔百和” 业务费用发生后五个月内向乙方提出异议 （系统产生用户 “魔百和” 业务费用当月起后5个月，不含当月）。<br> 18、因甲方欠费等信用原因，在甲方缴清所欠费用之前，乙方有权拒绝其登记各类通信服务项目以保护乙方自身利益。
        <br>
      </li>
      <li class="item">
        二、责任承担<br>1、乙方与甲方共同确定的地址，为甲方开通 “魔百和” 业务服务的地址。但由于存在技术数据达不到业务开通要求，或线路端口资源不到位等情形，造成确实无法装通的情形，届时乙方将退还甲方所缴费用（不计息），甲方同意免除乙方的责任。<br> 2、因电信业务的不断发展及技术上的需要，乙方有权对业务资料、操作流程、服务规则、计费标准与周期等进行变更、调整，有权关闭落后的网络，对此，乙方提前三十日（国家有规定的按国家规定的时限）以公告形式通知甲方并尽可能降低不利影响，甲方同意免除乙方因此产生的责任。
        <br> 3、甲方向乙方申告 “魔百和” 业务障碍或故障（不包括终端设备故障、甲方终端设备软硬件原因造成的障碍或故障、不可抵抗力、第三方原因等因素），乙方应在国家相关标准规定时限或乙方公开承诺时限内修复或者调通；不能如期修复或调通的，乙方免收障碍期间的 “魔百和” 业务费用。甲方承诺：无论何种原因当甲方不再使用乙方所提供的 “魔百和” 业务时，均持甲方有效身份证件前往乙方指定地点办理销户手续，否则甲方将承担由此产生的后果。<br> 4、在下列情况下，乙方有权限制、暂停或终止向甲方提供 “魔百和” 业务，由此给甲方造成的损失，乙方不承担责任：<br> 1）甲方银行账户被查封、冻结或余额不足等非乙方原因造成乙方结算时划扣不成功的；
        <br> 2）甲方预付费使用完毕而未及时补交款项（包括预付费账户余额不足以划扣下一笔预付费用）的；
        <br> 3）甲方将业务用于犯罪、违法或不正当用途的； <br> 4）甲方安装未取得入网许可，或可能影响网络安全、网络服务质量的设备的；
        <br> 5）甲方未办理相关手续，自行改变 “魔百和” 业务使用性质的；<br> 6）甲方未按照规定时间办理实名认证的；
        <br> 7）根据有关规定应当暂停提供服务的其它情况。行政机关要求本协议业务服务终止履行的，双方互不承担赔偿责任。
        <br> 5、本协议任何一方应承担的赔偿损失的责任范围不包括对方未实现的预期利润或利益、商业信誉的损失、数据的丢失、第三方损失以及其他间接损失。
        <br>
      </li>
      <li class="item">
        三、其他<br>1、本协议项下发生的争议，双方应协调解决，协商不成的，双方均可向有管辖权的人民法院提起诉讼解决。<br> 2、甲方办理各类业务所签署的业务受理单、表单、协议等为本协议的补充协议，与本协议冲突部分以补充协议为准，补充协议中未约定部分以本协议为准。
        <br> 3、本协议自双方签署之日起生效，一式贰份，甲乙双方各执一份，具有同等的法律效力。
        <br> 4、本协议于_____年_____月_____日签订于_______市_____区/县。
        <br> 本次收取甲方“魔百和”费用___________元，选择___________资费，设备押金________元/购买款_________元。
      </li>
    </ul>

    <ul class="custom_alert" v-else>
      <li class="item title">
        山东移动家庭宽带业务服务协议(上门服务专用)
      </li>
      <li class="item">
        甲方：
      </li>
      <li class="item">
        乙方：中国移动通信集团山东有限公司
      </li>
      <li class="item">
        友好提示：<br> &diams;甲方应具有完全的民事行为能力。无民事行为能力或限制民事行为能力的甲方入网时应经过其监护人的同意并签名确认。<br> &diams;在签署本协议之前，甲方（包括监护人）或其代理人应仔细阅读本协议各条款，如有疑问应及时咨询，并在所有疑问得到解答后再签署本协议。<br> &diams;甲方或其代理人在签署本协议后即视为完全理解并同意接受本协议的全部条款。<br> &diams;甲方所需的业务、办理手续、资费标准及交费方式等请参见乙方的相关业务说明；缴费过程中因甲方提供的关联移动手机号码不正确造成的缴费错误，具体责任由甲方承担。如甲方销号后复装机，需按乙方要求签订新的入网协议，并按最新资费标准办理。<br>根据《中华人民共和国合同法》、《中华人民共和国电信条例》及其他有关法律、法规的规定，甲乙双方在平等、自愿、公平、诚实、信用的基础上，就移动电话网络服务的有关事宜，达成协议如下：<br>
      </li>
      <li class="item">
        一、甲方的权利和义务<br> 1.甲方自愿接入乙方的家庭宽带业务；关联移动手机号码________。甲方选择 FTTH/FTTB 接入的_____Mbps宽带产品（下行带宽____Mbps,上行带宽____Mbps），预存_____元，套餐标准：____________________________________________。套餐期限____个月，在套餐期限内乙方承诺套餐资费不变，套餐到期后双方无异议，甲方可继续使用乙方服务，并按乙方标准资费按月缴纳产生费用，不满一个月的，乙方按一个月收取。标准资费按___________________执行。关联移动号码与宽带组合优惠自套餐期限到期后，不再享受本协议约定优惠。<br> 2.甲方办理家庭宽带业务时，需提供本人真实有效的身份证件，并与乙方签订受理单和本协议。因甲方提供资料不实造成乙方无法将有关信息及时通知甲方而造成的一切后果，由甲方承担。
        <br> 3.甲方在使用本业务时有义务遵守乙方有关业务规定，同时必须遵守国家相关法律法规。
        <br>
      </li>
      <li class="item">
        二、乙方的权利和义务<br> 1.乙方在甲方办理相关开户手续并缴清相关费用后按双方预约日期上门安装，若遇不可抵抗力、恶劣天气等因素造成无法施工及客户原因造成迟延，安装时间可顺延相应时限；
        <br> 2．乙方免费向甲方提供相关业务咨询，并在开通时由安装工程师对甲方进行简单的使用指导。
        <br> 3．有如下情形之一的，乙方有权立即停止向甲方提供本协议规定的部分或全部的服务：
        <br> （1）甲方提供的资料与实际不符；
        <br> （2）甲方在使用本业务时有违反国家相关法律法规（包括但不限于全国人大常委会《关于维护互联网安全的决定》、《中华人民共和国电信条例》、《中华人民共和国计算机信息系统安全保护条例》和公安部《计算机信息网络国际联网安全保护管理办法》）的行为或有危害乙方网络安全和合法权益的行为；
        <br> （3）甲方办理的宽带业务非由家庭使用，而用于商业用途；
        <br> （4）甲方未在乙方规定的时间内缴纳宽带服务费用或相关联手机服务费；
        <br> （5）甲方搬迁至乙方暂时无法提供服务的地区。
        <br>
      </li>
      <li class="item">
        三、其它事项<br> 1.乙方提供的宽带接入方式分为三类：第一类，线路已经入户，可直接开通，如甲方家中没有室内布线，乙方只能采用布放明线的方式开通；第二类，线路到达甲方门头，须打洞开通，如遇承重墙或墙体内已有线缆布放等特殊情况，可能导致无法开通；第三类，线路到达楼层弱电井，须穿线开通，如遇管道堵塞、多媒体盒移位等情况，须通过布放明线方可开通。甲方对乙方的上述开通方式表示接受。
        <br> 2.每一个帐号只能接入一台计算机；乙方为甲方开通时保证甲方室内初装信息点接通，不承担甲方室内其他点的布线及调试；若为FTTH接入的方式，乙方为甲方安装开通时提供市场价值____元的光猫1台，且收取相应设备押金（保证金）_____元/购买款_________元；若为押金方式租赁光猫，甲方退网时需向乙方提供押金收据和完好可用的光猫，甲方如无法提供押金收据和完好可用的光猫，则需赔付乙方____元设备费用，乙方向甲方无息退还保证金，并办理退网业务。若为购买方式购买光猫，乙方不退还甲方购买费用。
        <br> 3. 甲方在协议期内如办理退网业务，需补交180元初装接入费。<br> 4乙方不提供甲方户内线路变更、终端软硬件设置和调测、其他非乙方提供的设备线路维护调整服务。
        <br> 5.甲方需确保安装地址的管线畅通，在安装过程中如需要穿墙打洞、布放明线的，甲方予以认可并承诺协助协调物业、邻居等人员。如乙方安装人员在甲方指定并确认的位置打洞后，若出现任何非乙方原因而产生的损失（如水管、强电、弱电线路穿破等），乙方不承担任何责任。如果非因乙方原因无法接入宽带的，乙方向甲方退还所有预收款项，甲乙双方互不承担赔偿责任，同时本协议终止。
        <br> 6.互联网不同于传统交换网，甲方实际使用的网络带宽是动态变化的，主要取决于骨干带宽、运营商提供给客户的接入带宽和客户所访问的内容提供商的带宽。乙方向甲方提供宽带业务时，按下行速率最高可达进行承诺。“下行速率最高可达”是指甲方终端（不含）到数字集线器或交换机之间的线路和设备能支持的最大信息传送能力，是在理想网络条件下，甲方上网可能达到的最高速率，乙方对达到最高速率的时间段和时间比例不作承诺。
        <br> 7.因不可抗力，如地震、洪水、战争、雷电、火灾或国家政策调整等不能预见、不能避免并不能克服的因素，导致甲方无法正常使用宽带业务，由此造成的损失，乙方不承担任何责任。
        <br> 8.在使用过程中如果是由甲方电脑本身系统使用所产生的问题（如：电脑感染病毒、系统故障、所安装的相应软件丢失、软件使用不当等）、电脑硬件问题（如：电脑网卡、显示器、硬盘、CPU、主板、内存、光驱等）造成甲方不能正常使用乙方网络及其他增值服务，乙方不承担任何责任。
        <br> 9.因电信业务的不断发展及技术上的需要，乙方有权对业务资料、操作流程、服务规则、计费标准与周期等进行变更、调整，有权关闭落后的网络，对此，乙方提前三十日（国家有规定的按国家规定的时限）以公告形式通知甲方并尽可能降低不利影响，甲方同意免除乙方因此产生的责任。
        <br> 10.甲方申请新装或移机的地址需在乙方网络覆盖范围之内方可为其办理。
        <br> 11.甲方不得将申请的家庭宽带服务用于经营性项目、企业上网及其它商业用途。乙方一经发现用作经营项目的，乙方有权自入网之日起，按经营性用户收费标准补收网络使用费，并且乙方保留其他一切合法权利；用于企业上网的，乙方有权自入网之日起，按企业用户收费标准补收网络使用费，并且乙方保留其他一切合法权利；用于其他商业用途的，乙方有权自入网之日起，按其他商业用户收费标准补收网络使用费，并且乙方保留其他一切合法权利。
        <br> 12.本协议未尽事宜由双方友好协商解决或签订补充协议予以明确。本协议履行过程中，如因政策原因或市场环境变化等因素需要对本协议内容进行调整，双方应友好协商解决。如因不能预见并且发生的后果不能克服、不可避免的不可抗力因素造成协议无法继续履行，双方均有权终止协议。
        <br> 13．本协议发生争议双方应协商解决，协商不成时，双方均可向有管辖权的人民法院提起诉讼解决。
        <br> 14.本协议自双方签字或盖章之日起生效；
        <br> 15.除本协议另有约定外，出现下列情形之一的，本协议自动终止：
        <br> （1）甲方申请销户的，自乙方受理之日起终止；
        <br> （2）甲方申请过户的，自申请之日起终止；
        <br> （3）因甲方欠费导致乙方暂停服务60天后甲方账户被系统销户的，自被系统销户之日起终止。
        <br> 四、费用及结算
        <br> 1.乙方向甲方收取宽带业务接入费、设备租用费和网络使用费等，并保留在国家规定的资费政策范围内调整资费的权利。
        <br> 2.甲方须一次性缴清参与宽带活动所需宽带业务接入费、设备租用费和网络使用费和其他费用，计费时间从开通之日起计算。
        <br> 3.宽带业务标准资费为按月计费；甲方办理相关套餐或一次性预存部分费用享受乙方当期优惠促销活动，优惠活动结束后恢复为月标准资费，甲方可在活动到期前1-2个月提前到乙方营业厅申请宽带套餐变更、暂停、宽带销户及宽带续费促销活动。
        <br> 4.如甲方逾期不缴纳有关费用产生欠费的，将被暂停宽带业务接入服务（注：如甲方手机停机，乙方将确保甲方可继续使用72小时，如72小时内手机未复机，将暂停甲方宽带使用）。甲方补交所欠费用后，48小时内恢复开通宽带服务；
        <br> 5.对因甲方欠费等原因暂停60天的，甲方上网帐号将被注销，乙方同时保留费用催缴的权利；
        <br> 6.乙方向甲方收取的网络使用费不包含网络上任何收费服务项目的费用。
        <br> 五、业务变更条款
        <br> 1.宽带销户
        <br> （1）若甲方违反本协议相关条款提前解约的，则甲方应向乙方补缴宽带业务一次性接入费、安装调试费、营销礼品费（按所赠送礼品等价值退还现金）等作为违约金以弥补乙方损失；
        <br> （2）甲方如需申请销户，须缴清申请之日前所有应缴（欠缴）的费用及违约金；
        <br> （3）如甲方宽带账号已参与乙方的营销活动且在该营销活动协议期内的，如果甲方销户，则除按本协议承担违约责任外，还应按营销活动协议的约定支付违约金或将尚未消费的预存金额抵作违约金；
        <br> （4）甲方违反本协议约定销户后，其账户余额作为甲方因提前解除本协议而向乙方应支付的违约金，乙方不予退还；
        <br> （5）销户后如再次申请开通，需重新签署新装协议，并按新装用户资费政策交纳费用。
        <br> 2.宽带移机：宽带帐户名称不变，安装地址变更称为移机；
        <br> （1）甲方如需办理移机，应携带有效证件及服务密码至乙方营业厅出申请，需缴纳移机费用；
        <br> （2）甲方申请新装或移机的宽带地址需在乙方网络覆盖内，否则乙方向甲方退还所收预收款项，甲乙双方互不承担赔偿责任；
        <br> （3）甲方申请移机的宽带帐户当前状态必须正常，且移机期间甲方的宽带网络使用费仍正常收取。
        <br> 3.套餐变更
        <br> （1）甲方如需办理申请套餐变更，须携带有效证件及服务密码至乙方营业厅提出申请。
        <br> （2）甲方若为标准资费客户申请资费变更，当月申请，次账期生效。
        <br> （3）甲方若为促销资费客户，促销资费到期后按标准资费执行。
        <br> 六、协议期内，乙方有权决定是否允许甲方重复参加优惠活动。
        <br> 七、本协议自甲乙双方签订之日起生效，遇下列情况之一的，本协议自行终止：
        <br> 1.由于甲方违约致使乙方单方解除本协议的；
        <br> 2.由于国家政策或者乙方上级单位要求终止的。
        <br> 八、本协议一式贰份，甲乙双方各执一份，具有同等的法律效力。
        <br> 本协议于_____年_____月_____日签订于_______市_____区/县。
        <br> 九、本次上门服务收取甲方宽带费用___________元，设备押金________元/购买款_________元。
        <br> 甲方请于1个月之内凭此协议及身份证原件到营业厅换取正规营业收据，设备押金收据留存用于销户设备退还时退押金使用。
      </li>
    </ul>
  </common-alert>
</template>
<script>
export default {
  name: 'protocolAlert',
  /* ********************** props ********************** */
  props: {
    isHandleAlert: {
      type: Boolean,
      default: false
    },
    type: {
      type: String,
      default: 'newForm'
    }
  },

  /* ********************** data ********************** */

  data() {
    return {
    }
  },

  /* ********************** computed ********************** */

  computed: {},

  /* ********************** methods ********************** */

  methods: {
    // 协议弹窗回调
    handlePopupConfirm(type) {
      this.$emit('confirm', type)
    }
  },

  /* ********************** created ********************** */

  created() {
  }
}
</script>

<style lang="less" scoped>
.custom_alert {
  height: 3rem;
  padding: 0.3rem;
  overflow: auto;
  line-height: 0.36rem;
  .item {
    font-size: 0.22rem;
  }
  .title {
    font-size: 0.3rem;
    font-weight: 700;
    text-align: center;
  }
}
</style>
